export const questions = [
    "Есть ли у вас опыт близкого взаимодействия с животными, растениями или людьми? Примеры: вы лечили или принимали участие в лечении и уходе за больным человеком, животным, растением.",
    "Вы когда-нибудь проводили опыты с химией? Например: создавали смеси, вещества, проводили над ними опыты, поджигали, взрывали и тому подобное.",
    "Стремились ли вы попасть в зоопарк, в зоологический музей, в ботанический сад, в лес или в лечебницу, чтобы ещё раз увидеть жизнь животных, растений, или увидеть как лечат людей и животных.",
    "Химии или биологии вы посвящаете больше своего внимания, чем другим предметам в школе?",
    "В свободное время вы углублённо читаете о животных, растениях, вирусах и бактериях, устройстве человека, его мозге и т.п.?",
    "Читаете ли вы в свободное время про химические вещества и опыты с ними?",
    "Хотели ли бы ежедневно работать с каким-нибудь из этих объектов природы: человеческое тело, мозг, тело животных, растения, земля, вода, космос?",
    "Было бы вам интересно ежедневно разрабатывать, анализировать химические вещества в лаборатории, на заводе (например, кремы, лекарства, горючее и т.п.)?",
    "Нравится ли вам хотя бы один из этих предметов в школе: химия, биология?",
    "Согласились ли бы вы учиться биологии или химии всерьез несколько лет в вузе?",
    "Есть ли у вас успехи хотя бы в одном из этих предметов в школе: химия, биология?",
    "Зигота делится:",
    "Как связаны гены и хромосомы?",
    "Валентность - это",
    "Формула какой кислоты перед вами? H2SO4",
    "Вы с удовольствием занимались разбором или ремонтом техники дома?",
    "Занимались ли вы в техническом кружке или в кружке по информационным технологиями, на факультативе по физике и т.п.?",
    "В детстве вы очень любили играть с конструктором Лего, Brio и подобными?",
    "Вам было бы интересно сделать прозрачным реальный дом и посмотреть как там всё устроено: от подвала до лифтов, от лестниц до крыши?",
    "Доставляет ли вам удовольствие красивое и логичное решение математической задачи?",
    "Вам бы хотелось строить настоящие механизмы, приборы или здания?",
    "Есть ли у вас интуитивное понимание работы каких-нибудь приборов: механических или электрических?",
    "Вам легко даётся физика?",
    "Вам легко даются геометрия или черчение?",
    "Отец старше сына в 4 раза. Через 20 лет он станет старше сына в 2 раза. Сколько лет сейчас отцу?",
    "Вы уже писали статьи, фанфики, роман?",
    "Вы каждый день много читаете (не соцсети) и получаете удовольствие от чтения?",
    "Вы участвовали в олимпиадах по истории, обществознанию, русскому языку или литературе?",
    "Вы прочли несколько книг по истории, по искусствам?",
    "Вы легко запоминаете сведения из книг и статей по истории и искусствам?",
    "Вы любите читать биографии интересных людей?",
    "Вы согласны, что воспоминания реальных личностей - самое интересное чтение?",
    "Вам интересно узнавать о процессах, происходящих в обществе? Например, что приводит к революциям и войнам.",
    "Вы не понимаете людей, которым нравится вникать в туманные философские рассуждения?",
    "Вы любите участвовать в серьезных дискуссиях на общественные темы и обсуждать разные точки зрения?",
    "Вам интересно вникать в причины человеческих поступков?",
    "Вам легко рифмовать на любую тему?",
    "Ваши школьные сочинения иногда признавали лучшими?",
    "У вас отличная память на тексты?",
    "Что из этого вы делаете систематически и с удовольствием?",
    "Занимались ли вы всерьёз физическими упражнениями, спортом, танцами?",
    "Ожидая своей очереди в парикмахерской, вы взяли из стопки журнал. Какой раздел вы бы открыли в первую очередь?",
    "Если бы вы решили связать вашу жизнь со спортом, то что бы вы согласились делать?",
    "Какой предмет в школе ваш самый любимый?",
    "От чего вы получаете наибольшее удовольствие?",
    "Вы ловчее, сильнее, выносливее большинства ваших одноклассников, друзей, братьев и сестёр?",
    "У вас есть разряды, медали в спорте или в танцах?",
    "Вы заметили за собой, что не упускаете возможности что-то рассчитать, составить таблицу, найти закономерности?",
    "Каждый раз, когда возникает необходимость рассчитать расстояние, количество, сумму, вы с энтузиазмом берётесь за дело?",
    "Вы участвовали в олимпиадах по математике?",
    "Вы любите скрупулёзно составлять таблицы и заполнять их данными?",
    "Испытываете ли вы удовольствие от измерений и вычислений?",
    "Хотели ли бы вы, чтобы в вашей работе было много места вычислениям?",
    "Легко ли вы замечаете ошибки в вычислениях?",
    "Легко ли вы запоминаете числовые данные?",
    "Легко ли вам разобраться в значении неизвестной вам формулы?",
    "Телепередача была прервана тридцатисекундной рекламой 5 раз. Сколько процентов времени передачи было занято рекламой, если вся передача вместе с рекламой шла 50 минут?",
    "На изготовление 500г сыра уходит 7,25 литра молока. Сколько кг сыра можно сделать из 145 литров молока?",
    "Один человек в 3 раза старше другого. Если разность в их возрасте составляет 32 года, какова сумма их возрастов.",
    "Вы уже пробовали программировать?",
    "Вы смотрите, читаете про устройство операционных систем компьютера и самого компьютера?",
    "Получаете ли вы удовольствие от разбора компьютерных программ, их файлов в попытке узнать, как они устроены и как работают?",
    "Когда вы скачиваете и устанавливаете программы, вы точно знаете, куда конкретно они установились и почему они попадают именно сюда?",
    "Вам нравится ломать голову над логическими задачами?",
    "На день рождения к Винни Пуху пришли гости: Поросенок, Ослик Иа и Кролик. Поросенок пришёл раньше Кролика, но позже Ослика. Верно ли, что Ослик пришел раньше Кролика?",
    "Вы могли бы сидеть за компьютером целыми днями?",
    "Кого на свете больше?",
    "Один господин, показывая своему другу фотографию мальчика, говорит: \"У меня нет ни сестер, ни братьев, но отец этого человека сын моего отца\". Кто изображен на фотографии?",
    "Делаете ли вы что-то из этого вполне прилично? (Готовить, стричь, шить, стрелять, делать массаж, обрабатывать раны, собирать компьютеры, работать по дереву, металлу, камню и т.д?)",
    "Стремитесь ли вы делать что-то из этого в свободное время? (Готовить, стричь, шить, стрелять, делать массаж, обрабатывать раны, собирать компьютеры, работать по дереву, металлу, камню и т.д?)",
    "Вам нравится больше работать руками, чем вычислять, сочинять и читать тексты?",
    "Побуждают ли вас к действиям видеоролики о том, как кто-то что-то создаёт руками? Например, шьет, готовит, выпиливает, стрижет, обрабатывает раны, чинит, реставрирует, делает ювелирные украшения и т.п.",
    "Хотели бы вы учиться профессионально какому-нибудь из этих ремёсел? (Шитьё, кулинария, парикмахерское дело, столярное и плотницкое дело, ювелирное дело, реставрация, массаж и т.п.)",
    "Хотели бы, чтобы в вашей работе много места было не только для умственных, но и для ручных действий?",
    "Слышали ли вы положительные отзывы о том, что вы сделали руками?",
    "Говорили ли вам, что у вас золотые руки?",
    "Сколько бы вы ни старались что-то делать руками, ничего особенно хорошего не получается?",
    "Через неделю у важного для вас человека день рождения. Хочется преподнести своё собственное произведение (песню, поделку, картину, стихи и пр.). Ваши действия?",
    "Случалось ли вам увлечённо без сна и еды работать над своим творческим продуктом (песня, фильм, рисунок, рассказ и т.д.)?",
    "Были ли у вас случаи, когда вы старались довести до совершенства своё произведение, зная наверняка, что никто не заметит разницу?",
    "Если бы в компании возникла идея поставить спектакль, то вы бы выбрали для себя:",
    "Получаете ли вы удовольствие от рисования, сочинения музыки, придумывания одежды, придумывания историй и т.д.?",
    "Если бы за всё платили одинаково, что бы вы выбрали делать каждый день с утра до вечера?",
    "Вы легко импровизируете (в музыке, в рисовании, в актёрстве, в сочинении стихов и т.д.)?",
    "Как часто вас хвалили за ваши произведения (рисунок, фотографию, песню, стихотворение, рассказ и т.д.)?",
    "Легко ли вы придумываете что-нибудь из этого: орнаменты и узоры, логотипы, идеи для костюма, истории, мелодии, идеи интерьера и т.д.?",
    "Хорошо ли вы делаете что-то из этого: рисуете, сочиняете музыку, придумываете интересные сюжеты, снимаете интересные видео?",
    "Что вы делаете, когда находите дома ткани или запчасти, которые не нужны?",
    "Замечаете ли вы неполадки в вашем подъезде, в школе, на работе, в квартире и принимаете ли меры, чтобы их устранить? Например, разбитое окно, сломанная розетка и т.д.",
    "Вы часто с удовольствием систематизируете и упорядочиваете ваши вещи?",
    "Нравится ли вам создавать уют и комфорт для гостей?",
    "Интересно ли вам смотреть видео и читать книги об уборке и о том, как вести домашнее хозяйство?",
    "Если у вас растрепалась книга, отнесёте ли вы её на переплёт?",
    "Вы склонны экономить и накапливать деньги?",
    "Вы всегда помните, где и какие предметы лежат у вас дома?",
    "Когда вы планируете поездку, поход, отпуск, вы всегда знаете, что вам пригодится, а что нет, и никогда не берете лишнего и ничего важного не забываете?",
    "Когда возникают конфликтные ситуации, берёте ли вы на себя труд примирить конфликтующие стороны?",
    "Трудно ли вам выступать перед аудиторией, делая доклад или отвечая урок?",
    "Когда коллега/одноклассник просит вас объяснить непонятное по какому-то вопросу:",
    "Нравится ли вам, общаясь с кем-то, подмечать интонации и язык тела, чтобы составить картину о собеседнике?",
    "Если вас взволновало какое-то событие, фильм, книга, то вы обычно делитесь с кем-либо своими чувствами и мыслями?",
    "Когда мою работу недооценили или несправедливо занизили отметку:",
    "Хотите ли вы, чтобы каждый день на работе вы что-то делали с людьми непосредственно? Например, лечили бы их, учили, организовывали и т.д.",
    "Насколько вам трудно позвонить по телефону незнакомому человеку и что-то выяснить?",
    "Быстро ли вы устаёте от общения с людьми?",
    "Легко ли вы вливаетесь в новый коллектив?",
    "Трудно ли вам попросить вернуть долг, указать знакомому человеку на его ошибку?",
    "Пытались ли вы когда-нибудь заработать деньги по своей инициативе? Пример: купили дешевле, а продали дороже, сделали кому-то сайт и т.п.",
    "Читаете ли вы статьи, книги, сайты о маркетинге и продажах?",
    "Придумали ли вы схему заработка, которую не видели другие люди?",
    "Какой сценарий вы бы предпочли для себя?",
    "Вы постоянно изобретаете способы как вам заработать денег?",
    "Вдохновляют ли вас чьи-то рассказы о том, как бизнесмены зарабатывают деньги и как побеждают в конкурентной борьбе?",
    "Для какой цели банкир создал банк?",
    "Представьте себе, что в школе вы делаете интересный проект. Необходимо: найти источники информации, написать план действий, распределить роли и ответственность в команде каждого участника, контролировать работу, нести ответственность за результат работы команды. Награда - хорошая отметка. Что бы вы предпочли?",
    "Вы владелец завода лампочек. Вы тратите на производство одной лампочки 40 рублей. Вы продаёте лампочки магазинам. Такие лампочки магазины продают покупателям не дороже 180 рублей. По какой цене вы хотели бы продать лампочку магазину?",
    "Принимали ли вы участие в школьной или уличной драке?",
    "Что вы чувствуете во время конфликта, способного перерасти в драку?",
    "Занимались ли вы когда-нибудь боевыми искусствами? Например, борьбой, боксом, ММА и т.д.?",
    "Хотели бы вы работать, подвергая свою жизнь настоящей опасности, например, на поле боя, где вы можете погибнуть или покалечиться?",
    "Как вы оцениваете ваше здоровье?",
    "Считаете ли вы себя храбрым человеком (способным не бояться или преодолевать страх)?",
    "Сможете ли вы, если потребуется, пробежать 5 километров, не останавливаясь?",
    "Хотели бы вы в своей работе использовать оружие и/или военную технику?",
    "Представьте, что вы пожарный, входите в горящее здание. Ничего не видно из-за дыма, дышать нечем, очень сильный жар. Нашли бы вы силы в себе, чтобы так работать?"
]


export const answers = {
    "notSimpleAnswers": {
        11: ["Митозом", "Мейозом", "Не знаю"],
        12: ["Ген - это участок хромосомы", "Они связаны участком РНК", "Они вместе являются частью белка", "Ген состоит из РНК, а хромосомы из ДНК", "Не знаю"],
        13: ["Количество электронов на верхнем электронном уровне","Способность атомов вступать в соединение с другими атомами", "Количество атомов в молекуле", "Молекулярная масса", "Не знаю"],
        14: ["Соляная кислота", "Сероводородная", "Серная", "Фосфорная", "Не знаю"],
        16: ["Да, и мне понравилось это дело", "Да, но мне не понравилось это дело", "Нет"],
        17: ["Да, мне особенно нравилось делать не по образцу, а что-то своё", "Да, я делал всё по образцу", "Нет"],
        33: ["Да, я не понимаю таких людей", "Нет, я прекрасно понимаю таких людей"],
        39: ["Массаж другим людям", "Плавание", "Танцы", "Бег", "Тренировка в зале", "Ничего из вышеперечисленного"],
        40: ["Да, я это делаю систематически и с удовольствием", "Да, я это делаю потому, что меня заставляют родители", "Я танцую или занимаюсь спортом на уроках физкультуры, как и все", "Нет, ничем таким я не занимался"],
        41: ["Спорт, здоровый образ жизни, здоровое питание", "Медицина", "Красота, мода", "Психология", "Политика", "Культура"],
        42: ["Быть спортсменом, принимать участие в соревнованиях", "Писать о спорте", "Тренировать спортсменов", "Лечить спортсменов", "Организовывать спортивные соревнования", "Торговать спортивными товарами", "Ничего"],
        43: ["Математика", "Русский язык, литература", "Физкультура", "История, обществознание", "Химия", "Физика", "Иностранный язык", "Биология", "География"],
        44: ["Танцы", "Спорт", "Чтение книг", "Решение математических задач"],
        59: ["Да, с удовольствием", "Пробовал, но не очень понравилось", "Нет"],
        60: ["Да, с удовольствием", "Пробовал, но не очень понравилось", "Нет"],
        64: ["Верно", "Неверно", "Неопределенно"],
        66: ["Не птиц", "Не ворон"],
        67: ["Дед господина", "Отец господина", "Сам господина", "Сын господина", "Внук господина"],
        68: ["Да, с удовольствием", "Да, но только по необходимости", "Нет"],
        76: ["Да, не получается", "Нет, кое-какими результатами я даже горжусь"],
        77: ["Заранее продумываю идеи, выразительные детали и дорабатываю до совершенства.", "Всё придумаю и сделаю накануне.", "Вечеринка вечером? Вот утром что-нибудь и придумаю.", "Экспромт, только экспромт! На него спишу все несовершенства.", "Сам ничего не умею. Лучше куплю подарок в магазине."],
        78: ["Бывало, и не раз", "До такой степени я никогда не был увлечён"],
        80: ["Создать декорацию", "Создать компьютерные видеоэффекты", "Сочинить музыку", "Придумать танец", "Сшить костюм", "Сыграть роль", "Придумать идею спектакля", "Ничего не стал бы делать, мне это не интересно"],
        82: ["Придумывать одежду, образы", "Рисовать", "Делать компьютерный дизайн предметов, интерьеров, игр, рекламы, сайтов и т.п.", "Фотографировать и снимать видео", "Придумывать сценарии, стихи, рассказы", "Играть на музыкальных инструментах или петь", "Ничего из этого я бы не стал делать"],
        84: ["Часто", "Редко", "Никогда"],
        87: ["Выбрасываю", "Делаю из них что-то полезное"],
        88: ["Да, замечаю и принимаю меры", "Замечаю, но ничего не предпринимаю", "Не замечаю"],
        96: ["Да, я это делаю эффективно", "Нет, пусть разбираются сами", "Ко мне и не обращались за такой помощью"],
        97: ["Нет, мне это совсем не трудно", "Трудно, я очень волнуюсь и предпочитаю высказываться письменно"],
        98: ["Вы с удовольствием берётесь объяснить и объясняете понятно", "Вы объясняете, но от вашего объяснения не становится понятно", "Вы отказываетесь, пусть объясняет кто-то другой"],
        101: ["Я промолчу", "Я подойду к начальнику/учителю и постараюсь прояснить ситуацию"],
        103: ["Трудно, и я стараюсь отложить этот разговор", "Совсем не трудно, мне это даже нравится"],
        106: ["Да, я долго готовлюсь к этому разговору и всё равно мне неловко", "Я легко нахожу нужные слова, это для меня не проблема"],
        107: ["Да, у меня это хорошо получается", "Да, я пробовал, но мне не понравилось", "Нет"],
        110: ["Получить хорошую работу, стать специалистом, но не стремиться быть начальником", "Получить хорошую работу, продвинуться по службе, стать большим боссом, прилично зарабатывать", "Работать на себя, быть свободным от начальства, но работать больше других в надежде зарабатывать всё больше и больше в условиях конкуренции и сильных финансовых рисков"],
        113: ["Для хранения денег и ценных бумаг своих клиентов", "Для личного обогащения", "Для служения государству"],
        114: ["Написать план действий, распределить роли, контролировать выполнение, лично отвечать за результат работы всей команды", "Хорошо выполнить определённый фрагмент работы: найти источники информации, написать текст, сделать презентацию и подобное."],
        115: ["300 рублей", "180 рублей", "120 рублей", "40 рублей", "20 рублей"],
        116: ["Да, с удовольствием", "Да, но без удовольствия", "Никогда не дрался"],
        117: ["Меня это воодушевляет и придаёт мне сил", "Мне это некомфортно, я хочу скорее закончить конфликт миром"],
        120: ["Я полностью здоров - у меня отличное зрение, нет переломов или серьёзных травм, нет хронических заболеваний", "Я в целом здоров, но есть некоторые проблемы. Например, не 100% зрение, или есть переломы, или есть хронические заболевания"],
        24: ["40"],
        56: ["5"],
        57: ["10"],
        58: ["64"]
    },
    "isNeedInput": [24, 56, 57, 58],
    getAnswer(index){
        return this.notSimpleAnswers[index] !== undefined ? this.notSimpleAnswers[index] : ["Да", "Нет"]
    }
}

export const interestAnswers = [
    [0], [0], [0], [0], [0], [0], [0], [0], [0], [0],
    [0], [0], [0], [0], [0], [0], [0], [0], [0], [0], [0],
    [1], [0], [0], [0,1,2,3,4], [0], [0], [0,2], [2], [0,1], [0],
    [0], [0], [0], [0], [0], [0], [0], [0], [0], [0],
    [0], [0], [0], [0], [0], [0], [0,1,2,3,4,5,6], [0], [0,1,2,3,4,5],
    [1], [0], [0], [0], [0], [0], [0], [1], [0], [0],
    [2], [0], [1], [0], [0], [0], [0], [0], [0]
]

export const abilityAnswers = [
    [0], [0], [0], [1], [2], [1], [1], [0], [0], [0],
    [0], [0], [0], [0], [0], [0], [0], [1], [0], [0],
    [0], [0], [0], [0], [0], [0], [0], [0], [0], [0],
    [1], [2], [0], [0], [1], [0], [0], [0], [0], [0],
    [0], [0], [0], [0], [0], [0], [0], [1], [1], [0],
    [1], [0], [0], [0], [2], [1], [0], [0], [0]
]

export const abilityIndexes = [
    10,11,12,13,14,16,17,21,22,23,24,25,27,29,36,37,38,40,45,46,49,53,54,55,56,57,58,62,64,65,66,
    67,74,75,76,77, 83,84,85,86,89,90,92,95,96,97,98,103,104,105,106,107,109,111,115,116,118,120,122
]
export const interestIndexes = []
for (let i = 0; i < 125; i++){
    if(abilityIndexes.indexOf(i) === -1 || i === 16 || i === 17 || i === 40){
        interestIndexes.push(i)
    }
}
export const isInterestOrAbility = (index) => {
    if (abilityIndexes.indexOf(index) !== -1 && interestIndexes.indexOf(index) !== -1){
        return "all"
    }
    if (interestIndexes.indexOf(index) !== -1){
        return "interest"
    }
    return "ability"
}

export const categories = ["Естественные науки и практики", "Технические науки и практики", "Гуманитарные науки и практики",
    "Работа собственным телом", "Знаки: числа, таблицы и схемы", "Информационные технологии", "Ремёсла", "Искусства",
    "Хозяйство", "Коммуникативные практики", "Коммерция", "Военно-спасательные практики"
];
export const interestResults = [
    [
        "Вам не интересны биология и химия, а также устройство\n" +
    "организмов и способов их существования, у вас нет\n" +
    "потребности читать и думать про это и удивляться этому. Вы можете с интересом посмотреть хорошее видео про\n" +
    "животный мир. Можете иметь домашнего питомца, играть с ним, поливать домашние растения или по просьбе взрослых\n" +
    "что-то делать в саду и огороде без особенного желания. Вы могли бы даже обработать рану кому-то, но точно\n" +
    "понимая: каждый день работы с человеческим телом\n" +
    "«меня не хватит». Вы никак не можете вспомнить чем отличается митоз от\n" +
    "мейоза, вирус от бактерии и катион от аниона. При таком\n" +
    "уровне интереса к живой природе не стоит учиться на\n" +
    "химика, биолога, врача и т. д.\n",
        "Вас интересует биология или химия, устройство организмов и способов их существования. Вы можете с интересом посмотреть хорошее видео про\n" +
    "животный мир. Можете иметь домашнего питомца, играть с ним, поливать домашние растения или по просьбе взрослых\n" +
    "что-то делать в саду и огороде. При необходимости вы могли бы обработать рану кому-то. Вы показываете неплохие результаты в химии и биологии, но при таком уровне интереса вам лучше не учиться на\n" +
    "химика, биолога, врача и т. д.\n",
        "Вы показали высокий интерес к естественным наукам. Это выражается в интересе к устройству организмов и способам их существования, вы с удовольствием читаете и думаете об этом. Вы можете с интересом посмотреть хорошее видео про\n" +
        "животный мир. Можете иметь домашнего питомца, играть с ним, поливать домашние растения или \n" +
        "что-то делать в саду и огороде с особым интересом. Вы можете обработать кому-то рану, и точно понимаете, что готовы работать с человеческим телом каждый день. При таком уровне интереса к живой природе вы можете смело учиться на\n" +
        "химика, биолога, врача и т. д.\n"
    ],
    [
        "Приборы и оборудование вам неинтересны, не понятны, вызывают недоумение, может быть, опасение. Вы можете ими пользоваться, но «как все», не продвинутым способом, если что-то ломается, самостоятельно вы не возьметесь чинить, а позовете мастера. Вы не смотрите видео об устройстве и работе двигателя, электронных приборов. Если нужно купить прибор, вы возьмете с собой того, кто лучше в этом разбирается. Память у вас на технические сведения не очень хороша. Вам сложно понять разницу между силой тока и напряжением. При таком уровне интереса к технике не стоит учиться на инженерном факультете технического вуза.",
        "Вы показали средний уровень интереса к техническим наукам. Вы могли бы работать с приборами и оборудованием, пользоваться ими на продвинутом уровне. Если что-то сломается, вам интересно попробовать починить самостоятельно. Иногда вы смотрите видео об устройстве и работе двигателя, электронных приборов. Если нужно купить прибор, вы сможете разобраться в характеристиках сами. Память у вас на технические сведения не очень хороша. Вам сложно понять разницу между силой тока и напряжением. При таком уровне интереса к технике не стоит учиться на инженерном факультете технического вуза, если уровень способностей низкий.",
        "Приборы и оборудование вам интересны, вы можете ими пользоваться продвинутым способом, если что-то ломается, вы самостоятельно возьметесь чинить, а не позовете мастера. Вы смотрите видео об устройстве и работе двигателя, электронных приборов. Если нужно купить прибор, вы с легкостью справитесь с этим сами, так как разбираетесь в этом. Память у вас на технические сведения очень хороша. Вам легко понять разницу между силой тока и напряжением. При таком уровне интереса к технике вы можете смело идти учиться на инженерном факультете технического вуза."
    ],
    [
        "Вы показали довольно низкий уровень интереса к гуманитарному знанию и текстам. Вам не очень интересен человек, его поведение, душевная и духовная его жизнь, общественные процессы. Вы не желаете думать про это, может быть, вы даже не уважаете гуманитарные предметы в школе (история, обществознание, литература), не любите читать художественную литературу. Такое состояние интересов не предполагает работы педагогом, журналистом, психологом, политологом, историком.",
        "Вы показали средний уровень интереса к гуманитарному знанию и текстам. Вам не очень интересен человек, его поведение, душевная и духовная его жизнь, общественные процессы. Вы можете думать про это, может быть, вам нравятся какие-то гуманитарные предметы в школе (история, обществознание, литература). Такое состояние интересов не предполагает работы педагогом, журналистом, психологом, политологом, историком, если уровень способностей низок.",
        "Вы показали высокий уровень интереса к гуманитарному знанию и гуманитарной практике, что выражается в\n" +
        "неотступном размышлении на темы закономерностей\n" +
        "общественной жизни, поведения людей в прошлом и\n" +
        "настоящем. А также выражается в активном поиске и чтении - художественных, философских, политологических, искусствоведческих, литературоведческих, психологических текстов, а также в стремлении самому писать тексты: дневники, эссе, сочинения, а также во внимательном отношении к тексту и способности получать удовольствие от\n" +
        "хорошего текста или страдать от плохого текста. Такой выраженный интерес в сочетании со способностями к тексту может вас привести к профессиям гуманитарного типа: философия, филология, журналистика, политология, история, теология, социальная психология,\n" +
        "даже психотерапия.\n"
    ],
    [
        "Вы показали довольно низкий уровень интереса к работе собственным телом. Это выражается в нежелании производить существенные мышечные усилия и желании не производить такие усилия в течение работы и учебы и даже в свободное от работы время. Вы скорее выбрали бы работать сидя.",
        "Вы показали средний уровень интереса к работе собственным телом. Это выражается в желании телесно напрягаться не в\n" +
        "течение всего рабочего или учебного дня, а в желании\n" +
        "двигаться и напрягаться физически в свободное от\n" +
        "основных дел время.\n",
        "Вы показали довольно высокий уровень интереса к работе собственным телом. Это выражается в желании производить существенные мышечные усилия и желании производить такие усилия в течение работы и учебы и даже в свободное от работы время. Вам бы подошла работа с большим количеством физических нагрузок."
    ],
    [
        "Вы показали довольно низкий уровень интереса к\n" +
        "цифрам, схемам, таблицам. Это проявилось в довольно\n" +
        "низком уровне внимания к числам и другим знакам, а\n" +
        "также в полном отсутствии удовольствия от операций с\n" +
        "числами и таблицами и ощущении «бессмысленности»\n" +
        "данных операций, возможно, в стремлении избегнуть\n" +
        "этой работы и по возможности поручить эти действия\n" +
        "кому-то другому. С этим уровнем интереса и прилежания к знакам и системе знаков — лучше бы вам не помещать себя в ситуацию,\n" +
        "где придется много иметь дела с числами, графиками и\n" +
        "таблицами, то есть ни в налогах, ни в экономике, ни в\n" +
        "точных науках лучше не работать.\n",
        "Вы показали средний уровень интереса к цифрам, схемам, таблицам. Вы могли бы заниматься графиками, схемами, вычислениями лишь по необходимости и с некоторым внутренним сопротивлением. Вы у себя не наблюдаете стремления измерять и описывать в знаках что бы то ни было, зашифровывать что-то. С таким уровнем интереса и прилежания к знакам и системе знаков возможна работа в продажах, управлении гостиницей, маркетинге, архитектуре, технологиях производства — где вычисления есть, но они не преобладают по сравнению с другими действиями.",
        "Вы показали высокий уровень интереса к цифрам, схемам, таблицам. Вы могли бы заниматься графиками, схемами, вычислениями. Вы наблюдаете стремления измерять и описывать в знаках что бы то ни было, зашифровывать что-то. С таким уровнем интереса и прилежания к знакам и системе знаков возможна работа в этой сфере."
    ],
    [
        "Вы показали низкий уровень интереса к информационным технологиям. Это выражается в полном или почти полном отсутствии интереса к тому, как работает сам компьютер, его программы, а также страхе перед программами и компьютером. Вы ловко пользуетесь телефоном, но писать программы в действительности не захотите (при всех знаемых вами достоинствах профессии программист).",
        "Вы показали средний уровень интереса к информационным технологиям. Это выражается в почти полном отсутствии интереса к тому, как работает сам компьютер, его программы, а также возможном страхе перед программами и компьютером. Вы ловко пользуетесь телефоном, но писать программы в действительности вам будет сложно (при всех знаемых вами достоинствах профессии программист).",
        "Вы показали высокий уровень интереса к информационным технологиям. Это выражается в интересе к тому, как работает сам компьютер, его программы, а также в отсутствии страха перед программами и компьютером. Вы ловко пользуетесь телефоном, но и писать программы сможете с такой же ловкостью."
    ],
    [
        "Вы показали низкий уровень интереса к ручным действиям с предметами (камни, металлы, дерево, кожа,\n" +
        "ткани, продукты питания...). Это выражается в нежелании действовать с какими-либо\n" +
        "из материальных предметов вовсе. Случается, что вы\n" +
        "даже заявляете о таком интересе, но практически никогда не получаете удовольствия от этих действий и стремитесь поскорее закончить начатую не по вашей воле, а по\n" +
        "велению учителя труда или родителей, работу с материалами. С таким уровнем интереса и прилежания к ручной\n" +
        "работе с той или иной материей не стоит себе выбирать\n" +
        "работу, в которой есть даже элементы ручного труда.\n",
        "Вы показали средний уровень интереса к ручным действиям. И это выражается в том, что вы совершаете действия с предметами (камни, металл, ткани, дерево, мука и сахар и т.д.), но не часто, а иногда, и жалуясь, что «вдохновения нет». При наличии вдохновения вы можете что-то поделать, и у вас даже порой неплохо получается. Бывает, что видео в интернете или чужой пример побуждает вас купить материалы для работы, но до дела обычно не доходит. И мысль о том, чтобы делать руками интересную для вас работу ежедневно с утра до вечера — вызывает у вас не очень радостные чувства. Поэтому полностью исключать ручные действия из профессии вам не стоит, но и не стоит выбирать себе в качестве основной профессии только ручную работу.",
        "Вы показали высокий уровень интереса к ручным действиям с предметами (камни, металлы, дерево, кожа,\n" +
        "ткани, продукты питания...). Это выражается в желании работать с какими-либо\n" +
        "из материальных предметов. Вы часто получаете удовольствия от этих действий и стремитесь заниматься этим как можно дольше. С таким уровнем интереса и прилежания к ручной\n" +
        "работе с той или иной материей стоит себе выбирать\n" +
        "работу, в которой присутствуют элементы ручного труда.\n"
    ],
    [
        "Вы показали низкий уровень интереса к созданию художественных произведений (рисовать, лепить, музицировать, шить, стричь, красиво одевать людей, создавать интерьеры, фотографировать, ставить спектакли и танцы, писать художественные тексты и прочее). Это выражается в непостоянстве художественных усилий и в редких вдохновениях. Попытки учиться чему-то из этого приводят к вашим сомнениям «мое ли это». И мысль о том, что придется на работе рисовать каждый день или музицировать каждый день, вызывают у вас не очень приятные чувства. Вам лучше не выбирать профессию связанную с творчеством.",
        "Вы показали средний уровень интереса к созданию художественных произведений (рисовать, лепить, музицировать, шить, стричь, красиво одевать людей, создавать интерьеры, фотографировать, ставить спектакли и танцы, писать художественные тексты и прочее). Это выражается в непостоянстве художественных усилий и в редких вдохновениях. Попытки учиться чему-то из этого приводят к вашим сомнениям «мое ли это». И мысль о том, что придется на работе рисовать каждый день или музицировать каждый день, вызывают у вас противоречивые и не очень приятные чувства. Возможно, вы бы скорее хотели быть в творческой среде не творцом, а кем-то иным, например, организатором процесса или искусствоведом. Тогда вам надо выбирать не художественное направление, а управленческое, продюсерское, искусствоведческое.",
        "Вы показали высокий уровень интереса к изготовлению\n" +
        "художественных произведений. Это выражается в удовольствии от деятельности, которая ведет к созданию\n" +
        "художественного произведения. И проявляется в стремлении рисовать, лепить, музицировать, шить, стричь,\n" +
        "красиво одевать людей, создавать интерьеры, фотографировать, ставить спектакли и танцы, писать художественные тексты и прочее. Интерес также проявляется в постоянном стремлении\n" +
        "учиться этому в кружках, в художественной или музыкальной школе, в стремлении совершенствоваться в\n" +
        "мастерстве и в наслаждении чужими трудами. Часто\n" +
        "художник бывает еще и ремесленником, точнее — ремесленник может быть художником. Если эти интересы у вас совпадают, то вам имеет смысл\n" +
        "рассматривать художественное направление — какое\n" +
        "вам ближе по опыту и интересу: если вы рисуете — то\n" +
        "живопись, графический дизайн, если вы музицируете —\n" +
        "то музыка, если снимаете фото — то фотография или\n" +
        "видеография и т. п\n"
    ],
    [
        "Вы показали низкий уровень интересов в хозяйственной\n" +
        "области. Это выражается у вас в отсутствии заботы о\n" +
        "предметах и процессах быта. В фокусе вашего внимания не экономия средств, не разумное использовании ресурсов и отходов ни дома, ни на\n" +
        "рабочем месте: у вас другие интересы.\n",
        "Вы показали средний уровень интересов в хозяйственной области. Это выражается в личной вашей заботе о личных ваших предметах и процессах личного быта. Вы думаете об экономии средств, о разумном использовании ресурсов и отходов, но не готовы заниматься этим постоянно в качестве наемного сотрудника и даже в своем бизнесе вы были бы не в силах сосредоточить всё своё внимание на хозяйственных вопросах",
        "Вы показали высокий уровень интересов в хозяйственной\n" +
        "области. Это выражается у вас в заботе о\n" +
        "предметах и процессах быта. В фокусе вашего внимания экономия средств, разумное использовании ресурсов и отходов дома и на\n" +
        "рабочем месте.\n"
    ],
    [
        "Вы показали низкий уровень интереса к общению с людьми. Это выражается в отсутствии интереса к окружающим людям, закрытости, нежелании взаимодействовать с ними, знать обстоятельства их жизни. Интерес к людям может быть у интровертного человека, желающего не очень много общаться, но зато глубоко. У экстравертного человека интерес к общению проявляется иначе, чем у интроверта: в желании вступать в открытый контакт с большим количеством людей.",
        "Вы показали средний уровень интереса к общению с людьми. Это выражается в интересе к окружающим людям. Интерес к людям может быть у интровертного человека, желающего не очень много общаться, но зато глубоко. У экстравертного человека интерес к общению проявляется иначе, чем у интроверта: в желании вступать в открытый контакт с большим количеством людей.",
        "Вы показали высокий уровень интереса к общению с людьми. Это выражается в интересе к окружающим людям, открытости, желании взаимодействовать с ними, знать обстоятельства их жизни, в попытках понять причины их поведения, влиять на людей, организовывая их, воспитывая, развлекая и помогая им. А также в чтении биографической, психологической и художественной литературы. Интерес к людям может быть у интровертного человека, желающего не очень много общаться, но зато глубоко. У экстравертного человека интерес к общению проявляется иначе, чем у интроверта: в желании вступать в открытый контакт с большим количеством людей."
    ],
    [
        "Вы показали низкий уровень интересов к предпринимательству: вам не интересна тема бизнеса, и вы не делали попыток заработать самостоятельно. Вас не интересует литература о бизнесе. Если так будет и дальше – вам лучше выбрать профессию, не связанную с коммерцией и продажами.",
        "Вы показали средний уровень интересов к предпринимательству: вам интересна тема бизнеса, но пока вы не делали попыток заработать самостоятельно. Средний интерес к предпринимательству может выражаться в чтении литературы о бизнесе, в накопленных знаниях об основных экономических законах. Однако без попыток заработать самостоятельно интерес к бизнесу остается теоретическим. Если так будет и дальше - вы сможете работать наёмно в чужом бизнесе, делая определенный вклад в бизнес со своей стороны, например, как логист или как экономист-аналитик, маркетолог, специалист по продажам и т. п.",
        "Вы показали высокий уровень интересов к предпринимательству: вам интересна тема бизнеса, и вы делали попытки заработать самостоятельно. Высокий интерес к предпринимательству может выражаться в чтении литературы о бизнесе, в накопленных знаниях об основных экономических законах. С таким уровнем интереса вы можете смело идти в сферу продаж и коммерции и даже работать на себя."
    ],
    [
        "Вы показали низкий уровень интереса к деятельностям, связанным с риском: это выражается в полном отсутствии у вас попыток совершать рискованные действия ради удовольствия рисковать. Но чтение литературы о войне, об оружии, просмотр боевиков может быть интересен вам. Вам интересно наблюдать, как рискуют другие, но сами вы рисковать собой не согласны. Поэтому такие профессии, как пожарный, полицейский, пилот не подходят вам.",
        "Вы показали средний уровень интереса к деятельностям, связанным с риском: это выражается в отсутствии у вас попыток совершать рискованные действия или проблемах со здоровьем. Но чтение литературы о войне, об оружии, просмотр боевиков может быть интересен вам. Вам интересно наблюдать, как рискуют другие, но сами вы рисковать собой не согласны. Поэтому такие профессии, как пожарный, полицейский, пилот не вряд ли подойдут вам.",
        "Вы показали высокий уровень интереса к деятельностям, связанным с риском: это выражается в попытках совершать рискованные действия ради удовольствия рисковать. Чтение литературы о войне, об оружии, просмотр боевиков интересен вам. Вам интересно наблюдать, как рискуют другие, и вы готовы рисковать сами. Поэтому такие профессии, как пожарный, полицейский, пилот отлично подходят вам."
    ]
];

export const abilityResults = [
    [
        "Вы показали довольно низкий уровень способностей к работе с живой материей – с организмами и тканями, молекулами и атомами. Это выражается в сильном затруднении понимания, запоминания данных из биологии и химии. В этом случае не стоит становиться врачом, биологом, химиком-исследователем или химиком-технологом.",
        "Вы показали средний уровень способностей к естественным наукам. Это проявляется в том, что вам удается этому научиться и успешно действовать в этом русле, но вам это дается нелегко и не слишком быстро. При наличии интереса с таким уровнем способностей вы могли бы успешно работать в сфере естественных наук – медиком, биологом или химиком.",
        "Вы показали высокий уровень способностей к естественным наукам. Это выражается в ваших успехах в понимания, запоминания данных из биологии и химии. В этом случае вы можете смело становиться врачом, биологом, химиком-исследователем или химиком-технологом."
    ],
    [
        "Вы показали низкий уровень способностей к работе с приборами и оборудованием. Это выражаемся в непонимании вами их устройства и принципов работы, в непонимании физических показателей (масса и вес, напряжение и сила тока), в неумении производить расчеты с этими и другими физическими показателями. Вы вряд ли смогли бы починить какой-либо прибор. С этим уровнем способностей для вас невозможна успешная работа в инженерных профессиях.",
        "Вы показали средний уровень способностей к работе с приборами и оборудованием. Вы понимаете основные моменты устройства и принципов работы приборов и оборудования. Вы вряд ли смогли бы починить какой-либо прибор. С этим уровнем способностей для вас возможна успешная работа в инженерных профессиях, если уровень интереса высокий. ",
        "Вы показали высокий уровень способностей к работе с приборами и оборудованием. Это выражается в интуитивном понимании вами их устройства и принципов работы, в понимании физических показателей (масса и вес, напряжение и сила тока), в умении производить расчеты с этими и другими физическими показателями — для того, чтобы настроить и починить, и даже разработать новый прибор. Высокий уровень выражается в ваших успехах, когда вы создали (починили) реально работающий прибор. С этим уровнем способностей к технике — для вас возможна успешная работа в одной из инженерных профессий — как в разработке, так и в сервисе оборудования."
    ],
    [
        "Вы показали довольно низкий уровень способности к гуманитарному знанию и текстам. Это выражается в слабой способности рифмовать, недостаточном чувстве размера и ритма текста, а также в невозможности получать удовольствие от текста как такового, в трудностях понимания любого гуманитарного текста, кроме газетного.",
        "Вы показали средний уровень способности к гуманитарному знанию и текстам. Это выражается в неплохой способности рифмовать, возможно, недостаточном чувстве размера и ритма текста, а также в трудностях понимания гуманитарного текста, кроме, разве что, газетного.",
        "Вы показали довольно высокий уровень способностей к гуманитарному знанию и текстам. Это выражается в способности рифмовать, хорошем чувстве размера и ритма текста, а также в получении удовольствие от текста как такового, в понимании любого гуманитарного текста."
    ],
    [
        "Вы показали низкий уровень способностей к работе собственным телом. Это выражается в недостаточной развитости мышц или в болезненном их состоянии. Вам скорее подойдет кабинетная работа, без физических нагрузок.",
        "Вы показали средний уровень способностей к работе собственным телом. Возможно, у вас есть проблемы со здоровьем или слабо развиты мышцы. Вам может подойти работа, которая будет включать в себя незначительные физические нагрузки.",
        "Вы показали высокий уровень способностей к работе собственным телом. Это выражается в хорошей развитости мышц и хорошем состоянии здоровья. Вам отлично подойдет работа с большим количеством физических нагрузок."
    ],
    [
        "Вы показали низкий уровень способностей к действиям с цифрами, схемами, таблицами. Это проявляется в том, что вам не удаётся этому научиться и успешно действовать с этой материей. Вы не сможете работать с числами, таблицами, графиками.",
        "Вы показали средний уровень способностей к действиям с цифрами, схемами, таблицами. Это проявляется в том, что вам удаётся этому научиться и успешно действовать с этой материей, но вам это даётся не легко и не слишком быстро, а после упорного труда. При наличии интереса с такими уровнем способностей вы могли бы успешно работать с числами, таблицами, графиками.",
        "Вы показали высокий уровень способностей к действиям с цифрами, схемами, таблицами. Это проявляется в том, что вам удаётся этому научиться и успешно действовать с этой материей. С такими уровнем способностей вы могли бы успешно работать с числами, таблицами, графиками."
    ],
    [
        "Вы показали низкий уровень способностей к информационным технологиям. Вы не понимаете, что происходит в компьютерной сети и компьютере, в тяжелом понимании и запоминании материала, даваемого в школе на уроках информатики, математики. С таким уровнем способностей вы не сможете работать в этой сфере.",
        "Вы показали средний уровень способностей к информационным технологиям. И это проявляется в относительно легком понимании того, что происходит в компьютерной сети и компьютере, в относительной легкости овладевания программами и языками программирования, в не быстром, но и не тяжелом понимании и запоминании материала, даваемого в школе на уроках информатики, математики. С таким уровнем способностей вы бы могли работать и программистом, и в сетевым администратором, и системным администратором, и специалистам ИБ.",
        "Вы показали высокий уровень способностей к информационным технологиям. И это проявляется в легком понимании того, что происходит в компьютерной сети и компьютере, в легкости овладевания программами и языками программирования, в быстром и легком понимании и запоминании материала, даваемого в школе на уроках информатики, математики. С таким уровнем способностей вы бы могли работать и программистом, и в сетевым администратором, и системным администратором, и специалистам ИБ."
    ],
    [
        "Вы показали низкий уровень способностей к ручным действиям с материальными предметами. Это проявляется в сложности в обращении с инструментом и материалом, а также в низком качестве изготавливаемого вами продукта. С таким уровнем способностей к ручной работе с той или иной материей вы вряд ли сможете работать поваром, парикмахером, визажистом, столяром, плотники, печником, ювелиром, жестянщиком и т.д.",
        "Вы показали средний уровень способностей к ручным действиям с материальными предметами. Это проявляется в способностях в обращении с инструментом и материалом, но не самом лучшем качестве изготавливаемого вами продукта. С таким уровнем способностей к ручной работе с той или иной материей и при высоком уровне интересов вы могли бы успешно работать поваром, парикмахером, визажистом, столяром, плотники, печником, ювелиром, жестянщиком и т.д.",
        "Вы показали высокий уровень способностей к ручным действиям с материальными предметами. Это проявляется в выраженной ловкости в обращении с инструментом и материалом, а также в высоком качестве изготавливаемого вами продукта. С таким уровнем способностей к ручной работе с той или иной материей и при желании вы могли бы успешно работать поваром, парикмахером, визажистом, столяром, плотники, печником, ювелиром, жестянщиком и т.д."
    ],
    [
        "Вы показали низкий уровень способностей к созданию художественных произведений (рисовать, лепить, музицировать, шить, стричь, красиво одевать людей, создавать интерьеры, фотографировать, ставить спектакли и танцы, писать художественные тексты и прочее). Это выражается в недостаточной оригинальности вашего подхода и вашего взгляда на предмет, а также в недостаточной легкости исполнения. У вас нет собственных идей, и вам лучше не выбирать профессию связанную с этой сферой.",
        "Вы показали средний уровень способностей к созданию художественных произведений (рисовать, лепить, музицировать, шить, стричь, красиво одевать людей, создавать интерьеры, фотографировать, ставить спектакли и танцы, писать художественные тексты и прочее). Это выражается в недостаточной оригинальности вашего подхода и вашего взгляда на предмет, а также в недостаточной легкости исполнения. У вас нет собственных идей, но вы способны хорошо копировать чужие произведения. Однако при наличии упорства вы могли бы достичь впечатляющих результатов.",
        "Вы показали высокий уровень способностей к созданию художественных произведений (рисовать, лепить, музицировать, шить, стричь, красиво одевать людей, создавать интерьеры, фотографировать, ставить спектакли и танцы, писать художественные тексты и прочее). Это выражается в оригинальности вашего подхода и вашего взгляда на предмет, а также в легкости исполнения. У вас есть собственные идеи, и вы способны воплотить их в жизнь"
    ],
    [
        "Низкий уровень способностей не позволяет вам контролировать доходы и расходы, ведение хозяйственных процессов. Вы не способны совершать хозяйственные расчёты, думать об экономии средств, о разумном использовании ресурсов, лучше вам не заниматься этим профессионально и постоянно, ведь вы не в силах сосредоточить всё свое внимание на хозяйственных вопросах.",
        "Средний уровень способностей позволяет вам контролировать доходы и расходы, ведение хозяйственных процессов — но с постоянными и несущественными ошибками. Вы способны совершать хозяйственные расчёты, думать об экономии средств, о разумном использовании ресурсов, но лучше вам не заниматься этим профессионально и постоянно, ведь вы не в силах сосредоточить всё свое внимание на хозяйственных вопросах.",
        "Высокий уровень способностей позволяет вам контролировать доходы и расходы, ведение хозяйственных процессов. Вы способны совершать хозяйственные расчёты, думать об экономии средств, о разумном использовании ресурсов, вам легко заниматься этим профессионально и постоянно, ведь вы в силах сосредоточить всё свое внимание на хозяйственных вопросах."
    ],
    [
        "Вы показали высокий уровень интереса к общению с людьми. Это выражается в интересе к окружающим людям, открытости, желании взаимодействовать с ними, знать обстоятельства их жизни, в попытках понять причины их поведения, влиять на людей, организовывая их, воспитывая, развлекая и помогая им. А также в чтении биографической, психологической и художественной литературы. Интерес к людям может быть у интровертного человека, желающего не очень много общаться, но зато глубоко. У экстравертного человека интерес к общению проявляется иначе, чем у интроверта: в желании вступать в открытый контакт с бОльшим количеством людей.",
        "Вы показали средний уровень способностей к общению с людьми: это выражается в эмпатии, в возможном умении чувствовать и понимать настроения рядом находящихся людей, а также в умении доносить до человека вашу мысль, понимать направленное на вас сообщение, способность сопротивляться манипуляциям. Такие развитые коммуникативные умения необходимы в работе психолога, врача, менеджера, юриста, продавца и т. п., но вам лучше выбрать профессию с малым количеством взаимодействия с людьми.",
        "Вы показали высокий уровень способностей к общению с людьми: это выражается в эмпатии, в вашем интуитивном умении чувствовать и правильно понимать настроения рядом находящихся людей, а также в смелости преодолевать коммуникативные барьеры, в коммуникативной точности и умении доносить до человека вашу мысль, точно понимать направленное на вас сообщение, развитую способность сопротивляться манипуляциям. Такие развитые коммуникативные умения необходимы в работе психолога, врача, менеджера, юриста, продавца и т.п."
    ],
    [
        "Вы показали низкий уровень способностей к предпринимательству. Обычно это выражается в отсутствии попыток заработать своими собственными усилиями, не устраиваясь на работу наемно, отсутствии стремления самому находить цели и ставить перед собой задачи. Вам лучше выбрать профессию из других сфер, не связанных с коммерцией и продажами.",
        "Вы показали средний уровень способностей к предпринимательству. Обычно это выражается в попытках заработать своими собственными усилиями, но не всегда успешными. Способности к предпринимательству могут выражаться в самостоятельности в принятии решений, трудоспособности и воле к победе, а также в социальной смелости, высоком социальном интеллекте, здравом смысле и реалистичности.",
        "Вы показали высокий уровень способностей к предпринимательству. Обычно это выражается в успешных попытках заработать своими собственными усилиями, не устраиваясь на работу наемно, стремлении самому находить цели и ставить перед собой задачи. Способности к предпринимательству могут выражаться в самостоятельности в принятии решений, трудоспособности и воле к победе, а также в социальной смелости, высоком социальном интеллекте, здравом смысле и реалистичности."
    ],
    [
        "Вы показали низкий уровень способностей к деятельностям, связанным с риском: это выражается в неловкости, медлительности, эмоциональной нестабильности и (или) недостаточной внимательности. Вы можете делать роковые ошибки из-за неумения владеть собой в ситуации риска или неумении владеть физическими или ментальными инструментами. Вам лучше выбрать профессию, не связанную с риском.",
        "Вы показали средний уровень способностей к деятельностям, связанным с риском: это выражается в некоторой неловкости, медлительности, либо эмоциональной нестабильности и (или) недостаточной внимательности. Вы можете делать роковые ошибки из-за неумения владеть собой в ситуации риска или неумении владеть физическими или ментальными инструментами. Некоторые из этих недостатков можно исправить путем тренировок.",
        "Вы показали высокий уровень способностей к деятельностям, связанным с риском: это выражается в ловкости, скорости, эмоциональной стабильности и внимательности. Вы не делаете ошибок, потому что умеете владеть собой в ситуации риска, а также владеть физическими и ментальными инструментами. Вам хорошо подойдут профессии, связанные с риском, например, военный, пожарный, спасатель МЧС и др."
    ]
];

const interestLevels = [
    [3,7,10], [2,4,6], [3,6,8], [2,4,6], [1,3,5], [1,3,4], [2,4,6], [2,4,5], [2,4,6], [1,3,4], [2,4,5], [2,4,5]
]

const abilityLevels = [
    [2,4,5], [2,4,6], [2,4,6], [1,2,3], [2,5,7], [1,3,5], [1,3,4], [1,2,4], [1,3,5], [2,5,7], [1,3,4], [1,3,4]
]

export const getResults = (category, score, isFoundInterestResult) => {
    if(isFoundInterestResult){
        for (let i = 0; i < 3; i++){
            if (score <= interestLevels[category][i]){
                return interestResults[category][i]
            }
        }
    }
    else {
        for (let i = 0; i < 3; i++){
            if (score <= abilityLevels[category][i]){
                return abilityResults[category][i]
            }
        }
    }
}